Reports/СводНачисленнойЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>СводНачисленнойЗарплатыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокОрганизаций</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПодразделений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСотрудников</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СводныеДанныеПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИПНСведенияОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ИПНСведенияОДоходах</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОблагаемаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененныйВычет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримененнаяЛьгота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенныйВычет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИПНЗаявлениеНаПредоставлениеВычета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособНалогообложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыНалогообложенияДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ВычетыИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИПНРасчетыСБюджетом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ИПНРасчетыСБюджетом</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РасчетыСБюджетомФондамиВидСтроки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОПВРасчетыСФондами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ОПВРасчетыСФондами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РасчетыСБюджетомФондамиВидСтроки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВБюджетИФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВОСМСРасчетыСФондами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ВОСМСРасчетыСФондами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Взнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидСтроки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РасчетыСБюджетомФондамиВидСтроки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВБюджетИФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СНИсчисленный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>СНИсчисленный</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НеОтражатьВРеглУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/СводНачисленнойЗарплатыОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	Результат = Новый ТабличныйДокумент;
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.СписокСотрудников) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СотрудникиОрганизаций.Физлицо
			|ИЗ
			|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
			|ГДЕ
			|	СотрудникиОрганизаций.Ссылка В(&СписокСотрудников)";
		
		Запрос.УстановитьПараметр("СписокСотрудников", ПараметрыОтчета.СписокСотрудников);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда

		Иначе
			 МассивФизЛиц = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ФизЛицо");
			 Если МассивФизЛиц.Количество() = 1 Тогда
				 ПараметрыОтчета.Вставить("СписокФизЛиц", МассивФизЛиц[0]);
			 Иначе
				 ПараметрыОтчета.Вставить("СписокФизЛиц", МассивФизЛиц);
			 КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СформироватьСводНачисленийУдержаний(Результат, ПараметрыОтчета);
	
	ПоместитьВоВременноеХранилище(Новый Структура("Результат", Результат), АдресХранилища);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СформироватьЗапрос(ПараметрыОтчета)

	ОтборОрганизации   = ЗначениеЗаполнено(ПараметрыОтчета.СписокОрганизаций);
	ОтборПодразделения = ЗначениеЗаполнено(ПараметрыОтчета.СписокПодразделений);
	ОтборРаботника     = ПараметрыОтчета.Свойство("СписокФизЛиц") И ЗначениеЗаполнено(ПараметрыОтчета.СписокФизЛиц);
	
	СводныеДанныеПоОрганизациям = ПараметрыОтчета.СводныеДанныеПоОрганизациям;
	
	ЗапросСвод = Новый Запрос;
	ЗапросСвод.УстановитьПараметр("ПериодРегистрации", 	  		 НачалоМесяца(ПараметрыОтчета.НачалоПериода));
	ЗапросСвод.УстановитьПараметр("КонецПериодаРегистрации", 	 КонецМесяца(ПараметрыОтчета.КонецПериода));
	ЗапросСвод.УстановитьПараметр("ПослеКонцаПериодаРегистрации",КонецМесяца(ПараметрыОтчета.КонецПериода) + 1);
	ЗапросСвод.УстановитьПараметр("ВидСтроки",              	 Перечисления.РасчетыСБюджетомФондамиВидСтроки.Исчисление);
	ЗапросСвод.УстановитьПараметр("ВидПлатежа",              	 Перечисления.ВидыПлатежейВБюджетИФонды.Налог);
	ЗапросСвод.УстановитьПараметр("Приход", 					 ВидДвиженияНакопления.Приход);
	ЗапросСвод.УстановитьПараметр("Расход", 					 ВидДвиженияНакопления.Расход);
	ЗапросСвод.УстановитьПараметр("ВнутреннееСовместительство",  Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	ЗапросСвод.УстановитьПараметр("ПустоеПодразделение",  		 Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	ЗапросСвод.УстановитьПараметр("Уволен",				  		 Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ЗапросСвод.УстановитьПараметр("ЧерезБанк",					 Перечисления.СпособыВыплатыЗарплаты.ЧерезБанк);
	ЗапросСвод.УстановитьПараметр("ЧерезКассу",					 Перечисления.СпособыВыплатыЗарплаты.ЧерезКассу);
	ЗапросСвод.УстановитьПараметр("Возврат",					 Перечисления.РасчетыСБюджетомФондамиВидСтроки.Возврат);
	
	ЕстьУсловияВЗапросе = ОтборОрганизации Или ОтборРаботника;
	ТекстУсловия = "";
	
	Если ОтборОрганизации Тогда
		
		ЗапросСвод.УстановитьПараметр("Организация", ПараметрыОтчета.СписокОрганизаций);
		
		Если ПараметрыОтчета.ВидСравненияОрганизации = ВидСравнения.Равно Тогда
			ВидСравненияОрганизацииСтрокой = " = &Организация" 
		ИначеЕсли ПараметрыОтчета.ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			ВидСравненияОрганизацииСтрокой = " <> &Организация"
		ИначеЕсли ПараметрыОтчета.ВидСравненияОрганизации = ВидСравнения.ВСписке Тогда
			ВидСравненияОрганизацииСтрокой = " В (&Организация)"
		Иначе
			ВидСравненияОрганизацииСтрокой = " НЕ В (&Организация)"
		КонецЕсли; 
		
		ТекстУсловия = "<имя поля организация>" + ВидСравненияОрганизацииСтрокой;
		
	КонецЕсли;  
	
	Если ОтборРаботника Тогда
		
		ЗапросСвод.УстановитьПараметр("РаботникиОрганизации", ПараметрыОтчета.СписокФизЛиц);
	
		Если ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.Равно Тогда
			ВидСравненияРаботник = " = &РаботникиОрганизации" 
		ИначеЕсли ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.НеРавно Тогда
			ВидСравненияРаботник = " <> &РаботникиОрганизации"
		ИначеЕсли ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.ВСписке Тогда
			ВидСравненияРаботник = " В (&РаботникиОрганизации)"
		ИначеЕсли ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.НеВСписке Тогда
			ВидСравненияРаботник = " НЕ В (&РаботникиОрганизации)"
		ИначеЕсли ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.ВСпискеПоИерархии ИЛИ 
			ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.ВИерархии Тогда
			ВидСравненияРаботник = " В ИЕРАРХИИ (&РаботникиОрганизации)"
		ИначеЕсли ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.НеВСпискеПоИерархии ИЛИ 
			ПараметрыОтчета.ВидСравненияРаботника = ВидСравнения.НеВИерархии Тогда
			ВидСравненияРаботник = " НЕ В ИЕРАРХИИ (&РаботникиОрганизации)"
		КонецЕсли; 
		
		ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = "","",Символы.ПС + " И ") + "<имя поля работник>" + ВидСравненияРаботник;
				
	КонецЕсли; 
	
	// Сформируем текст запроса с датами месяцев налогового периода
	// первый месяц
	НачалоМесяца = НачалоМесяца(ПараметрыОтчета.НачалоПериода);
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат (НачалоМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	// прибавим остальные месяцы
	Пока НачалоМесяца < НачалоМесяца(ПараметрыОтчета.КонецПериода) Цикл
		НачалоМесяца = КонецМесяца(НачалоМесяца) + 1;
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачалоМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ";
	Если Не СводныеДанныеПоОрганизациям Тогда 
		ТекстЗапроса = ТекстЗапроса + "
		|	НачисленияУдержания.Организация КАК Организация,
		|	НачисленияУдержания.Организация.Наименование КАК ИмяОрганизация,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	НачисленияУдержания.ВидРасчета,
	|	НачисленияУдержания.ВидРасчетаНаименование,
	|	НачисленияУдержания.ВидДвижения,
	|	СУММА(НачисленияУдержания.ОтработаноДней) КАК ОтработаноДней,
	|	СУММА(НачисленияУдержания.ОтработаноЧасов) КАК ОтработаноЧасов,
	|	СУММА(НачисленияУдержания.УчитываемыеДни) КАК УчитываемыеДни,
	|	СУММА(НачисленияУдержания.УчитываемыеЧасы) КАК УчитываемыеЧасы,
	|	СУММА(НачисленияУдержания.Начисления) КАК Начисления,
	|	СУММА(НачисленияУдержания.Удержания) КАК Удержания,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержания.СуммаВзаиморасчетовНачальныйОстаток > 0
	|				ТОГДА НачисленияУдержания.СуммаВзаиморасчетовНачальныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгЗаПредприятиемНаНачалоМесяца,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержания.СуммаВзаиморасчетовНачальныйОстаток < 0
	|				ТОГДА -НачисленияУдержания.СуммаВзаиморасчетовНачальныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгЗаРаботникамиНаНачалоМесяца,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержания.СуммаВзаиморасчетовКонечныйОстаток > 0
	|				ТОГДА НачисленияУдержания.СуммаВзаиморасчетовКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгЗаПредприятиемНаКонецМесяца,
	|	СУММА(ВЫБОР
	|			КОГДА НачисленияУдержания.СуммаВзаиморасчетовКонечныйОстаток < 0
	|				ТОГДА -НачисленияУдержания.СуммаВзаиморасчетовКонечныйОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгЗаРаботникамиНаКонецМесяца,
	|	СУММА(НачисленияУдержания.СоциальныйНалог) КАК СоциальныйНалог,
	|	СУММА(НачисленияУдержания.СоциальныеОтчисления) КАК СоциальныеОтчисления,
	|	СУММА(НачисленияУдержания.ОППВ) КАК ОППВ,
	|	СУММА(НачисленияУдержания.ОПВР) КАК ОПВР,
	|	СУММА(НачисленияУдержания.ООСМС) КАК ООСМС,
	|	СУММА(НачисленияУдержания.ЕП) КАК ЕП,
	|	СУММА(НачисленияУдержания.ЕПЗаСчетРаботодателя) КАК ЕПЗаСчетРаботодателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК ВидДвижения,// начисления
	|		ОсновныеНачисленияРаботниковОрганизации.ПодразделениеОрганизации.Владелец КАК Организация,
	|		ОсновныеНачисленияРаботниковОрганизации.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|		ОсновныеНачисленияРаботниковОрганизации.ФизЛицо КАК ФизЛицо,
	|		ОсновныеНачисленияРаботниковОрганизации.Ссылка.ПериодРегистрации КАК ПериодРегистрации,
	|		ОсновныеНачисленияРаботниковОрганизации.ВидРасчета КАК ВидРасчета,
	|		ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.Наименование КАК ВидРасчетаНаименование,
	|		ВЫБОР
	|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЗачетОтработанногоВремени
	|				ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней 
	|			ИНАЧЕ 0	
	|		КОНЕЦ КАК ОтработаноДней,
	|		ВЫБОР
	|			КОГДА ОсновныеНачисленияРаботниковОрганизации.ВидРасчета.ЗачетОтработанногоВремени
	|				ТОГДА ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов 
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОтработаноЧасов,
	|		ОсновныеНачисленияРаботниковОрганизации.ОтработаноДней КАК УчитываемыеДни,
	|		ОсновныеНачисленияРаботниковОрганизации.ОтработаноЧасов КАК УчитываемыеЧасы,
	|		ОсновныеНачисленияРаботниковОрганизации.Результат КАК Начисления,
	|		0 КАК Удержания,
	|		0 КАК СуммаВзаиморасчетовНачальныйОстаток,
	|		0 КАК СуммаВзаиморасчетовКонечныйОстаток,
	|		0 КАК СоциальныйНалог,
	|		0 КАК СоциальныеОтчисления,
	|		0 КАК ОППВ,
	|		0 КАК ОПВР,
	|		0 КАК ООСМС,
	|		0 КАК ЕП,
	|		0 КАК ЕПЗаСчетРаботодателя
	|	ИЗ
	|		Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК ОсновныеНачисленияРаботниковОрганизации
	|	ГДЕ
	|		ОсновныеНачисленияРаботниковОрганизации.Ссылка.Проведен
	|		И ОсновныеНачисленияРаботниковОрганизации.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
	|";
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ОсновныеНачисленияРаботниковОрганизации.ПодразделениеОрганизации.Владелец"),"<имя поля работник>","ОсновныеНачисленияРаботниковОрганизации.ФизЛицо")
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		6, // доп доход,
	|		ИПНСведенияОДоходах.Организация,
	|		NULL,
	|		ИПНСведенияОДоходах.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ИПНСведенияОДоходах.ПериодРегистрации, МЕСЯЦ),
	|		ИПНСведенияОДоходах.ВидРасчета,
	|		ИПНСведенияОДоходах.ВидРасчета.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ИПНСведенияОДоходах.СуммаДохода КАК Результат,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|ИЗ
	|	РегистрНакопления.ИПНСведенияОДоходах КАК ИПНСведенияОДоходах
	|ГДЕ
	|	ИПНСведенияОДоходах.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
	|	И (ИПНСведенияОДоходах.Регистратор ССЫЛКА Документ.РегистрацияПрочихДоходовВЦеляхНалогообложения)
	|	И (ИПНСведенияОДоходах.ФизЛицо ССЫЛКА Справочник.ФизическиеЛица)
	|";
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ИПНСведенияОДоходах.Организация"),"<имя поля работник>","ИПНСведенияОДоходах.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		5, // прочие удержания
	|		УдержанияРаботниковОрганизации.Ссылка.Организация,
	|		NULL,
	|		УдержанияРаботниковОрганизации.ФизЛицо,
	|		УдержанияРаботниковОрганизации.Ссылка.ПериодРегистрации,
	|		УдержанияРаботниковОрганизации.ВидРасчета,
	|		УдержанияРаботниковОрганизации.ВидРасчета.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		УдержанияРаботниковОрганизации.Результат,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0, 
	|		0,
	|		0

	|	ИЗ
	|		Документ.РасчетУдержанийРаботниковОрганизаций.Удержания КАК УдержанияРаботниковОрганизации
	|	ГДЕ
	|		УдержанияРаботниковОрганизации.Ссылка.Проведен
	|		И УдержанияРаботниковОрганизации.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
	|";
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","УдержанияРаботниковОрганизации.Ссылка.Организация"),"<имя поля работник>","УдержанияРаботниковОрганизации.ФизЛицо")
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		5, // прочие удержания ЕП
	|		РасчетЕПУдержанияРаботниковОрганизации.Ссылка.Организация,
	|		NULL,
	|		РасчетЕПУдержанияРаботниковОрганизации.ФизЛицо,
	|		РасчетЕПУдержанияРаботниковОрганизации.Ссылка.ПериодРегистрации,
	|		РасчетЕПУдержанияРаботниковОрганизации.ВидРасчета,
	|		РасчетЕПУдержанияРаботниковОрганизации.ВидРасчета.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетЕПУдержанияРаботниковОрганизации.Результат,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		Документ.РасчетЕдиногоПлатежа.Удержания КАК РасчетЕПУдержанияРаботниковОрганизации
	|	ГДЕ
	|		РасчетЕПУдержанияРаботниковОрганизации.Ссылка.Проведен
	|		И РасчетЕПУдержанияРаботниковОрганизации.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
	|";
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","РасчетЕПУдержанияРаботниковОрганизации.Ссылка.Организация"),"<имя поля работник>","РасчетЕПУдержанияРаботниковОрганизации.ФизЛицо")
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		5, // прочие удержания
	|		УдержанияРаботниковОрганизации.Ссылка.Организация,
	|		NULL,
	|		УдержанияРаботниковОрганизации.ФизЛицо,
	|		УдержанияРаботниковОрганизации.Ссылка.ПериодРегистрации,
	|		УдержанияРаботниковОрганизации.ВидРасчета,
	|		УдержанияРаботниковОрганизации.ВидРасчета.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		УдержанияРаботниковОрганизации.Результат,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		Документ.РегистрацияРазовыхУдержанийРаботниковОрганизаций.Удержания КАК УдержанияРаботниковОрганизации
	|	ГДЕ
	|		УдержанияРаботниковОрганизации.Ссылка.Проведен
	|		И УдержанияРаботниковОрганизации.Ссылка.ПериодРегистрации МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
	|";
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","УдержанияРаботниковОрганизации.Ссылка.Организация"),"<имя поля работник>","УдержанияРаботниковОрганизации.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		2, // ИПН
	|		ИПНРасчетыСБюджетом.Организация,
	|		NULL,
	|		ИПНРасчетыСБюджетом.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ИПНРасчетыСБюджетом.Период, МЕСЯЦ),
	|		""ИПН исчисленный"",
	|		""ИПН исчисленный"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ИПНРасчетыСБюджетом.Налог,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.ИПНРасчетыСБюджетом КАК ИПНРасчетыСБюджетом
	|	
	|	ГДЕ
	|		ИПНРасчетыСБюджетом.Активность И
	|		ИПНРасчетыСБюджетом.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ИПНРасчетыСБюджетом.ВидДвижения = &Приход И
	|		ИПНРасчетыСБюджетом.ВидСтроки = &ВидСтроки И
	|		ИПНРасчетыСБюджетом.НеОтражатьВРеглУчете = ЛОЖЬ И
	|		(ИПНРасчетыСБюджетом.ФизЛицо ССЫЛКА Справочник.ФизическиеЛица)
	|"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ИПНРасчетыСБюджетом.Организация"),"<имя поля работник>","ИПНРасчетыСБюджетом.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		3, // ОПВ
	|		ОПВРасчетыСФондами.Организация,
	|		NULL,
	|		ОПВРасчетыСФондами.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ОПВРасчетыСФондами.Период, МЕСЯЦ),
	|		""ОПВ исчисленный"",
	|		""ОПВ исчисленный"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОПВРасчетыСФондами.Взнос,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.ОПВРасчетыСФондами КАК ОПВРасчетыСФондами
	|	
	|	ГДЕ
	|		ОПВРасчетыСФондами.Активность И
	|		ОПВРасчетыСФондами.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ОПВРасчетыСФондами.ВидДвижения = &Приход И
	|		ОПВРасчетыСФондами.ВидСтроки = &ВидСтроки И
	|		ОПВРасчетыСФондами.ВидПлатежа = &ВидПлатежа И 
	|		ОПВРасчетыСФондами.ФизЛицо ССЫЛКА Справочник.ФизическиеЛица"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ОПВРасчетыСФондами.Организация"),"<имя поля работник>","ОПВРасчетыСФондами.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		4, // ВОСМС
	|		ВОСМСРасчетыСФондами.Организация,
	|		NULL,
	|		ВОСМСРасчетыСФондами.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ВОСМСРасчетыСФондами.Период, МЕСЯЦ),
	|		""ВОСМС исчисленные"",
	|		""ВОСМС исчисленные"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВОСМСРасчетыСФондами.Взнос,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.ВОСМСРасчетыСФондами КАК ВОСМСРасчетыСФондами
	|	ГДЕ
	|	    ВОСМСРасчетыСФондами.Активность И
	|	    ВОСМСРасчетыСФондами.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ВОСМСРасчетыСФондами.ВидДвижения = &Приход И
	|		ВОСМСРасчетыСФондами.ВидСтроки = &ВидСтроки И
	|		ВОСМСРасчетыСФондами.ВидПлатежа = &ВидПлатежа И
	|		(ВОСМСРасчетыСФондами.ФизЛицо ССЫЛКА Справочник.ФизическиеЛица)
	|"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ВОСМСРасчетыСФондами.Организация"),"<имя поля работник>","ВОСМСРасчетыСФондами.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		8, // СН
	|		СНИсчисленный.Организация,
	|		NULL,
	|		СНИсчисленный.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(СНИсчисленный.Период, МЕСЯЦ),
	|		""СН исчисленный"",
	|		""СН исчисленный"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		СНИсчисленный.Налог,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.СНИсчисленный КАК СНИсчисленный
	|	ГДЕ
	|	    СНИсчисленный.Активность И
	|	    СНИсчисленный.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		СНИсчисленный.НеОтражатьВРеглУчете = ЛОЖЬ
	|"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","СНИсчисленный.Организация"),"<имя поля работник>","СНИсчисленный.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		9, //СО
	|		СОРасчетыСФондами.Организация,
	|		NULL,
	|		СОРасчетыСФондами.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(СОРасчетыСФондами.Период, МЕСЯЦ),
	|		""СО исчисленные"",
	|		""СО исчисленные"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		СОРасчетыСФондами.Отчисление,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.СОРасчетыСФондами КАК СОРасчетыСФондами
	|	
	|	ГДЕ
	|		СОРасчетыСФондами.Активность И
	|		СОРасчетыСФондами.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		СОРасчетыСФондами.ВидДвижения = &Приход И
	|		СОРасчетыСФондами.ВидСтроки = &ВидСтроки И
	|		СОРасчетыСФондами.ВидПлатежа = &ВидПлатежа"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","СОРасчетыСФондами.Организация"),"<имя поля работник>","СОРасчетыСФондами.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		10, //ОППВ
	|		ОППВРасчетыСФондами.Организация,
	|		NULL,
	|		ОППВРасчетыСФондами.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ОППВРасчетыСФондами.Период, МЕСЯЦ),
	|		""ОППВ исчисленный"",
	|		""ОППВ исчисленный"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОППВРасчетыСФондами.Взнос,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.ОППВРасчетыСФондами КАК ОППВРасчетыСФондами
	|	
	|	ГДЕ
	|		ОППВРасчетыСФондами.Активность И
	|		ОППВРасчетыСФондами.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ОППВРасчетыСФондами.ВидДвижения = &Приход И
	|		ОППВРасчетыСФондами.ВидСтроки = &ВидСтроки И
	|		ОППВРасчетыСФондами.ВидПлатежа = &ВидПлатежа"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ОППВРасчетыСФондами.Организация"),"<имя поля работник>","ОППВРасчетыСФондами.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		11, //ОПВР
	|		ОПВРРасчетыСФондами.Организация,
	|		NULL,
	|		ОПВРРасчетыСФондами.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ОПВРРасчетыСФондами.Период, МЕСЯЦ),
	|		""ОПВР исчисленный"",
	|		""ОПВР исчисленный"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОПВРРасчетыСФондами.Взнос,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ОПВРРасчетыСФондами КАК ОПВРРасчетыСФондами
	|	
	|	ГДЕ
	|		ОПВРРасчетыСФондами.Активность И
	|		ОПВРРасчетыСФондами.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ОПВРРасчетыСФондами.ВидДвижения = &Приход И
	|		ОПВРРасчетыСФондами.ВидСтроки = &ВидСтроки И
	|		ОПВРРасчетыСФондами.ВидПлатежа = &ВидПлатежа"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ОПВРРасчетыСФондами.Организация"),"<имя поля работник>","ОПВРРасчетыСФондами.ФизЛицо")
	КонецЕсли;
					
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		11, //ООСМС
	|		ООСМСРасчетыСФондами.Организация,
	|		NULL,
	|		ООСМСРасчетыСФондами.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ООСМСРасчетыСФондами.Период, МЕСЯЦ),
	|		""ООСМС исчисленные"",
	|		""ОООСМС исчисленные"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ООСМСРасчетыСФондами.Отчисление,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.ООСМСРасчетыСФондами КАК ООСМСРасчетыСФондами
	|	
	|	ГДЕ
	|		ООСМСРасчетыСФондами.Активность И
	|		ООСМСРасчетыСФондами.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ООСМСРасчетыСФондами.ВидДвижения = &Приход И
	|		ООСМСРасчетыСФондами.ВидСтроки = &ВидСтроки И
	|		ООСМСРасчетыСФондами.ВидПлатежа = &ВидПлатежа"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ООСМСРасчетыСФондами.Организация"),"<имя поля работник>","ООСМСРасчетыСФондами.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		12, //ЕП
	|		ЕПРасчетыСФондами.Организация,
	|		NULL,
	|		ЕПРасчетыСФондами.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ЕПРасчетыСФондами.Период, МЕСЯЦ),
	|		""ЕП исчисленные"",
	|		""ЕП исчисленные"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЕПРасчетыСФондами.СуммаПлатежа,
	|		0

	|	ИЗ
	|		РегистрНакопления.ЕПРасчетыСФондами КАК ЕПРасчетыСФондами
	|	
	|	ГДЕ
	|		ЕПРасчетыСФондами.Активность И
	|		ЕПРасчетыСФондами.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ЕПРасчетыСФондами.ВидДвижения = &Приход И
	|		ЕПРасчетыСФондами.ВидСтроки = &ВидСтроки И
	|		ЕПРасчетыСФондами.ВидПлатежа = &ВидПлатежа"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ЕПРасчетыСФондами.Организация"),"<имя поля работник>","ЕПРасчетыСФондами.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		4, //ЕП
	|		ЕПКомпоненты.Организация,
	|		NULL,
	|		ЕПКомпоненты.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ЕПКомпоненты.Период, МЕСЯЦ),
	|		""ЕП (за счет работника)"",
	|		""ЕП (за счет работника)"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЕПКомпоненты.СуммаОПВ + ЕПКомпоненты.СуммаВОСМС + ЕПКомпоненты.СуммаИПН,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ
	|		РегистрНакопления.ЕПКомпоненты КАК ЕПКомпоненты
	|	
	|	ГДЕ
	|		ЕПКомпоненты.Активность И
	|		ЕПКомпоненты.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ЕПКомпоненты.ВидПлатежа = &ВидПлатежа"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ЕПКомпоненты.Организация"),"<имя поля работник>","ЕПКомпоненты.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		12, //ЕП
	|		ЕПКомпоненты.Организация,
	|		NULL,
	|		ЕПКомпоненты.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ЕПКомпоненты.Период, МЕСЯЦ),
	|		""ЕП (за счет работодателя)"",
	|		""ЕП (за счет работодателя)"",
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЕПКомпоненты.СуммаООСМС + ЕПКомпоненты.СуммаСО + ЕПКомпоненты.СуммаОПВР

	|	ИЗ
	|		РегистрНакопления.ЕПКомпоненты КАК ЕПКомпоненты
	|	
	|	ГДЕ
	|		ЕПКомпоненты.Активность И
	|		ЕПКомпоненты.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации И
	|		ЕПКомпоненты.ВидПлатежа = &ВидПлатежа"; 
		
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ЕПКомпоненты.Организация"),"<имя поля работник>","ЕПКомпоненты.ФизЛицо")
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|	
	|	ОБЪЕДИНИТЬ ВСЕ 
	|	";

	ТекстЗапросаПоВзаиморасчетам = "
	|	ВЫБРАТЬ
	|		ВзаиморасчетыСРаботникамиОрганизацииНачальныеОстатки.Организация КАК Организация,
	|		ВзаиморасчетыСРаботникамиОрганизацииНачальныеОстатки.ФизЛицо КАК ФизЛицо,
	|		&ПериодРегистрации КАК ПериодРегистрации,
	|		""НачальныйОстаток"" КАК ВидДвижения,
	|		0 КАК Удержания,
	|		ВзаиморасчетыСРаботникамиОрганизацииНачальныеОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовНачальныйОстаток,
	|		0 КАК СуммаВзаиморасчетовКонечныйОстаток
	|	ИЗ 
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&ПериодРегистрации, 
	|";
	
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","Организация"),"<имя поля работник>","ФизЛицо")
	КонецЕсли;	
	
	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам +
	"
	|		 ) КАК ВзаиморасчетыСРаботникамиОрганизацииНачальныеОстатки ";

	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + "
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзаиморасчетыСРаботникамиОрганизацииКонечныеОстатки.Организация КАК Организация,
	|		ВзаиморасчетыСРаботникамиОрганизацииКонечныеОстатки.ФизЛицо КАК ФизЛицо,
	|		НАЧАЛОПЕРИОДА(&КонецПериодаРегистрации, МЕСЯЦ) КАК ПериодРегистрации,
	|		""КонечныйОстаток"" КАК ВидДвижения,
	|		0 КАК Удержания,
	|		0 КАК СуммаВзаиморасчетовНачальныйОстаток,
	|		ВзаиморасчетыСРаботникамиОрганизацииКонечныеОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовКонечныйОстаток
	|	ИЗ 
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(&ПослеКонцаПериодаРегистрации, 
	|";
	
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","Организация"),"<имя поля работник>","ФизЛицо")
	КонецЕсли;	
	
	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам +
	"
	|		 ) КАК ВзаиморасчетыСРаботникамиОрганизацииКонечныеОстатки ";

	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + "
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзаиморасчетыСРаботникамиОрганизацииРасход.Организация КАК Организация,
	|		ВзаиморасчетыСРаботникамиОрганизацииРасход.ФизЛицо КАК ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ВзаиморасчетыСРаботникамиОрганизацииРасход.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСРаботникамиОрганизацииРасход.СпособВыплаты = &ЧерезБанк
	|				ТОГДА ВЫБОР
	|							КОГДА ВзаиморасчетыСРаботникамиОрганизацииРасход.ВидСтроки = &Возврат
	|								ТОГДА ""Возвращено из банка""
	|							ИНАЧЕ ""Перечислено в банк""
	|					  КОНЕЦ
	|			КОГДА ВзаиморасчетыСРаботникамиОрганизацииРасход.СпособВыплаты = &ЧерезКассу
	|				ТОГДА ВЫБОР
	|							КОГДА ВзаиморасчетыСРаботникамиОрганизацииРасход.ВидСтроки = &Возврат
	|								ТОГДА ""Возвращено в кассу""
	|							ИНАЧЕ ""Выплачено из кассы""
	|					  КОНЕЦ
	|			ИНАЧЕ ""Прочие выплаты""
	|		КОНЕЦ КАК ВидДвижения,
	|		ВзаиморасчетыСРаботникамиОрганизацииРасход.СуммаВзаиморасчетов КАК Удержания,
	|		0 КАК СуммаВзаиморасчетовНачальныйОстаток,
	|		0 КАК СуммаВзаиморасчетовКонечныйОстаток
	|	ИЗ 
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизацииРасход
	|
	|	ГДЕ
	|		ВзаиморасчетыСРаботникамиОрганизацииРасход.Активность И
	|		ВзаиморасчетыСРаботникамиОрганизацииРасход.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
	|		И ВзаиморасчетыСРаботникамиОрганизацииРасход.ВидДвижения = &Расход
	|";
	
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + Символы.ПС + " И " + Символы.ПС +
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ВзаиморасчетыСРаботникамиОрганизацииРасход.Организация"),"<имя поля работник>","ВзаиморасчетыСРаботникамиОрганизацииРасход.ФизЛицо")
	КонецЕсли;	
	
	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + "
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ВзаиморасчетыСДепонентамиОрганизацииНачальныеОстатки.Организация КАК Организация,
	|		ВзаиморасчетыСДепонентамиОрганизацииНачальныеОстатки.ФизЛицо КАК ФизЛицо,
	|		&ПериодРегистрации КАК ПериодРегистрации,
	|		""НачальныйОстаток"" КАК ВидДвижения,
	|		0 КАК Удержания,
	|		ВзаиморасчетыСДепонентамиОрганизацииНачальныеОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовНачальныйОстаток,
	|		0 КАК СуммаВзаиморасчетовКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Остатки(&ПериодРегистрации, 
	|";
	
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","Организация"),"<имя поля работник>","ФизЛицо")
	КонецЕсли;	
	
	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам +
	"
	|		 ) КАК ВзаиморасчетыСДепонентамиОрганизацииНачальныеОстатки ";
	
	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + "
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ВзаиморасчетыСДепонентамиОрганизацииКонечныеОстатки.Организация КАК Организация,
	|		ВзаиморасчетыСДепонентамиОрганизацииКонечныеОстатки.ФизЛицо КАК ФизЛицо,
	|		НАЧАЛОПЕРИОДА(&КонецПериодаРегистрации, МЕСЯЦ) КАК ПериодРегистрации,
	|		""КонечныйОстаток"" КАК ВидДвижения,
	|		0 КАК Удержания,
	|		0 КАК СуммаВзаиморасчетовНачальныйОстаток,
	|		ВзаиморасчетыСДепонентамиОрганизацииКонечныеОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Остатки(&ПослеКонцаПериодаРегистрации, 
	|";
	
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","Организация"),"<имя поля работник>","ФизЛицо")
	КонецЕсли;	
	
	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам +
	"
	|		 ) КАК ВзаиморасчетыСДепонентамиОрганизацииКонечныеОстатки ";

	ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + "
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ВзаиморасчетыСДепонентамиОрганизации.Организация КАК Организация,
	|		ВзаиморасчетыСДепонентамиОрганизации.ФизЛицо КАК ФизЛицо,
	|		НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентамиОрганизации.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		ВЫБОР
	|			КОГДА ВзаиморасчетыСДепонентамиОрганизации.СпособВыплаты = &ЧерезБанк
	|				ТОГДА ВЫБОР
	|							КОГДА ВзаиморасчетыСДепонентамиОрганизации.ВидСтроки = &Возврат
	|								ТОГДА ""Возвращено из банка""
	|							ИНАЧЕ ""Перечислено в банк""
	|					  КОНЕЦ
	|			КОГДА ВзаиморасчетыСДепонентамиОрганизации.СпособВыплаты = &ЧерезКассу
	|				ТОГДА ВЫБОР
	|							КОГДА ВзаиморасчетыСДепонентамиОрганизации.ВидСтроки = &Возврат
	|								ТОГДА ""Возвращено в кассу""
	|							ИНАЧЕ ""Выплачено из кассы""
	|					  КОНЕЦ
	|			ИНАЧЕ ""Прочие выплаты""
	|		КОНЕЦ КАК ВидДвижения,
	|		ВЫБОР КОГДА ВзаиморасчетыСДепонентамиОрганизации.ВидДвижения = &Расход ТОГДА 1 ИНАЧЕ -1 КОНЕЦ * ВзаиморасчетыСДепонентамиОрганизации.СуммаВзаиморасчетов КАК Удержания,
	|		0 КАК СуммаВзаиморасчетовНачальныйОстаток,
	|		0 КАК СуммаВзаиморасчетовКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций КАК ВзаиморасчетыСДепонентамиОрганизации
	|
	|	ГДЕ
	|		ВзаиморасчетыСДепонентамиОрганизации.Активность И
	|		ВзаиморасчетыСДепонентамиОрганизации.Период МЕЖДУ &ПериодРегистрации И &КонецПериодаРегистрации
	|";
	
	Если ЕстьУсловияВЗапросе Тогда
		ТекстЗапросаПоВзаиморасчетам = ТекстЗапросаПоВзаиморасчетам + Символы.ПС + " И " + Символы.ПС + 
						СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","ВзаиморасчетыСДепонентамиОрганизации.Организация"),"<имя поля работник>","ВзаиморасчетыСДепонентамиОрганизации.ФизЛицо");
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|    ВЫБРАТЬ 
	|		7, // Выплаты
	|		ВыплатаЗарплаты.Организация,
	|		NULL,
	|		ВыплатаЗарплаты.ФизЛицо,
	|		ВыплатаЗарплаты.ПериодРегистрации,
	|		ВыплатаЗарплаты.ВидДвижения,
	|		ВыплатаЗарплаты.ВидДвижения,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		СУММА(ВыплатаЗарплаты.Удержания),
	|		СУММА(ВыплатаЗарплаты.СуммаВзаиморасчетовНачальныйОстаток),
	|		СУММА(ВыплатаЗарплаты.СуммаВзаиморасчетовКонечныйОстаток),
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0

	|	ИЗ 
	|		(" + ТекстЗапросаПоВзаиморасчетам + ") КАК ВыплатаЗарплаты
	|
	|	СГРУППИРОВАТЬ ПО
	|		ВыплатаЗарплаты.Организация,
	|		ВыплатаЗарплаты.ФизЛицо,
	|		ВыплатаЗарплаты.ПериодРегистрации,
	|		ВыплатаЗарплаты.ВидДвижения
	|	
	|       ) КАК НачисленияУдержания
	|";


	Если ОтборПодразделения Тогда
		
		ЗапросСвод.УстановитьПараметр("ПодразделениеОрганизации", ПараметрыОтчета.СписокПодразделений);
		Если ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.Равно Тогда
			ВидСравненияСтрокой = " = &ПодразделениеОрганизации" 
		ИначеЕсли ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.НеРавно Тогда
			ВидСравненияСтрокой = " <> &ПодразделениеОрганизации"
		ИначеЕсли ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.ВСписке Тогда
			ВидСравненияСтрокой = " В (&ПодразделениеОрганизации)"
		ИначеЕсли ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.НеВСписке Тогда
			ВидСравненияСтрокой = " НЕ В (&ПодразделениеОрганизации)"
		ИначеЕсли ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.ВСпискеПоИерархии ИЛИ ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.ВИерархии Тогда
			ВидСравненияСтрокой = " В ИЕРАРХИИ (&ПодразделениеОрганизации)"
		ИначеЕсли ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.НеВСпискеПоИерархии ИЛИ ПараметрыОтчета.ВидСравненияПодразделения = ВидСравнения.НеВИерархии Тогда
			ВидСравненияСтрокой = " НЕ В ИЕРАРХИИ (&ПодразделениеОрганизации)"
		КонецЕсли; 
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " 
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|							РаботникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо,
		|							РаботникиОрганизации.Организация,
		|							РаботникиОрганизации.ОбособленноеПодразделение,
		|							Периоды.Период КАК ПериодРегистрации,
		|							МАКСИМУМ(ВЫБОР 
		|										КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
		|											ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизации.Период, ДЕНЬ, -1)
		|										ИНАЧЕ РаботникиОрганизации.Период
		|									КОНЕЦ) КАК Период
		|						ИЗ
		|							(" + ПериодыТекст + ") КАК Периоды
		|							ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|								ПО РаботникиОрганизации.Период <= КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ) 
		|						ГДЕ
		|							(РаботникиОрганизации.Сотрудник.ВидЗанятости <> &ВнутреннееСовместительство)  
		|";
		
		Если  ЕстьУсловияВЗапросе Тогда 
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + " И " + Символы.ПС + 
							СтрЗаменить(СтрЗаменить(ТекстУсловия,"<имя поля организация>","РаботникиОрганизации.ОбособленноеПодразделение"),"<имя поля работник>","РаботникиОрганизации.Сотрудник.ФизЛицо")
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|						СГРУППИРОВАТЬ ПО
		|							РаботникиОрганизации.Сотрудник.ФизЛицо,
		|							РаботникиОрганизации.Организация,
		|							РаботникиОрганизации.ОбособленноеПодразделение,
		|							Периоды.Период) КАК РаботникиОрганизацииСрезПоследних
		|		ПО НачисленияУдержания.Организация = РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение 
		|		   И НачисленияУдержания.ФизЛицо = РаботникиОрганизацииСрезПоследних.ФизЛицо
		|		   И НачисленияУдержания.ПериодРегистрации = РаботникиОрганизацииСрезПоследних.ПериодРегистрации
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|		ПО РаботникиОрганизацииСрезПоследних.Организация = РаботникиОрганизации.Организация
		|		   И РаботникиОрганизацииСрезПоследних.ФизЛицо = РаботникиОрганизации.Сотрудник.ФизЛицо
		|		   И (РаботникиОрганизации.Сотрудник.ВидЗанятости <> &ВнутреннееСовместительство)
		|		   И РаботникиОрганизацииСрезПоследних.Период = ВЫБОР
		|															КОГДА РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
		|																ТОГДА ДОБАВИТЬКДАТЕ(РаботникиОрганизации.Период, ДЕНЬ, -1)
		|															ИНАЧЕ РаботникиОрганизации.Период
		|														КОНЕЦ
		|				
		|ГДЕ
		|	РаботникиОрганизации.ПодразделениеОрганизации " + ВидСравненияСтрокой
		
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|СГРУППИРОВАТЬ ПО";
	Если Не СводныеДанныеПоОрганизациям Тогда
		ТекстЗапроса = ТекстЗапроса + " 	
		|	НачисленияУдержания.Организация,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	НачисленияУдержания.ВидДвижения,
	|	НачисленияУдержания.ВидРасчета,
	|	НачисленияУдержания.ВидРасчетаНаименование
	|
	|УПОРЯДОЧИТЬ ПО";
	Если Не СводныеДанныеПоОрганизациям Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	НачисленияУдержания.Организация.Наименование,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	НачисленияУдержания.ВидДвижения,
	|	НачисленияУдержания.ВидРасчетаНаименование
	|";
	
	ЗапросСвод.Текст = ТекстЗапроса;
	
	Возврат ЗапросСвод.Выполнить();	
	
КонецФункции // СформироватьЗапрос()

Процедура СформироватьСводНачисленийУдержаний(ТабличныйДокумент, ПараметрыОтчета)
	
	Макет 		  	= ПолучитьМакет("Макет");
	ОбластьШапка  	= Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	ОбластьСНСО 	= Макет.ПолучитьОбласть("СНСО");
	ОбластьИтоги 	= Макет.ПолучитьОбласть("Итоги");
	ОбластьОППВ		= Макет.ПолучитьОбласть("ОППВ");
	ОбластьООСМС_ОПВР	= Макет.ПолучитьОбласть("ООСМС_ОПВР");
	ОбластьЕП		= Макет.ПолучитьОбласть("ЕП");
	
	// Информация об отборе.
	ОбластьШапка.Параметры.Отбор = "";
	
	Если ПараметрыОтчета.Свойство("СписокФизЛиц") И ЗначениеЗаполнено(ПараметрыОтчета.СписокФизЛиц) Тогда
		
	 	СписокФизЛиц = ПараметрыОтчета.СписокФизЛиц;
	
		СписокОтбор = "";
		СписокОтбор = СписокОтбор + НСтр("ru='Работники '")+ ПараметрыОтчета.ВидСравненияРаботника;
		
		Если ТипЗнч(СписокФизЛиц) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Если СписокФизЛиц = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
				СписокОтбор = СписокОтбор + НСтр("ru=' <Не задано значение>'");
			Иначе
				СписокОтбор = СписокОтбор + " " + СписокФизЛиц;
			КонецЕсли;
		Иначе
			Если СписокФизЛиц.Количество() = 0 Тогда
				СписокОтбор = СписокОтбор + НСтр("ru=' <Не задано значение>'");
			Иначе	
				СписокОтбор = СписокОтбор + " " + СтрСоединить(СписокФизЛиц, ", ");
			КонецЕсли; 
		КонецЕсли;
		ОбластьШапка.Параметры.Отбор = НСтр("ru='Отбор: '") + СписокОтбор;
		
	КонецЕсли; 

	Если ЗначениеЗаполнено(ПараметрыОтчета.СписокОрганизаций) И ПараметрыОтчета.СводныеДанныеПоОрганизациям Тогда
		
		СписокОрганизаций = ПараметрыОтчета.СписокОрганизаций;
		
		СписокОтбор = "";
		СписокОтбор = СписокОтбор + НСтр("ru='Организации '") + ПараметрыОтчета.ВидСравненияОрганизации;
		
		Если ТипЗнч(СписокОрганизаций) = Тип("СправочникСсылка.Организации") Тогда
			Если СписокОрганизаций = Справочники.Организации.ПустаяСсылка() Тогда
				СписокОтбор = СписокОтбор + НСтр("ru=' <Не задано значение>'");
			Иначе
				СписокОтбор = СписокОтбор + " " + СписокОрганизаций;
			КонецЕсли;
		Иначе
			Если СписокОрганизаций.Количество() = 0 Тогда
				СписокОтбор = СписокОтбор + НСтр("ru=' <Не задано значение>'");
			Иначе	
				СписокОтбор = СписокОтбор + " " + СтрСоединить(СписокОрганизаций.ВыгрузитьЗначения(), ", ");
			КонецЕсли; 
		КонецЕсли;
		Если ОбластьШапка.Параметры.Отбор <> "" Тогда
			ОбластьШапка.Параметры.Отбор = ОбластьШапка.Параметры.Отбор + "; ";
		КонецЕсли;
		ОбластьШапка.Параметры.Отбор = ОбластьШапка.Параметры.Отбор + СписокОтбор;

	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыОтчета.СписокПодразделений) Тогда
		
		СписокПодразделений = ПараметрыОтчета.СписокПодразделений;
		
		СписокОтбор = "";
		СписокОтбор = СписокОтбор + НСтр("ru='Подразделения '") + ПараметрыОтчета.ВидСравненияПодразделения;
		
		Если ТипЗнч(СписокПодразделений) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			Если СписокПодразделений = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
				СписокОтбор = СписокОтбор + НСтр("ru=' <Не задано значение>'");
			Иначе
				СписокОтбор = СписокОтбор + " " + СписокПодразделений;
			КонецЕсли;
		Иначе
			Если СписокПодразделений.Количество() = 0 Тогда
				СписокОтбор = СписокОтбор + НСтр("ru=' <Не задано значение>'");
			Иначе	
				СписокОтбор = СписокОтбор + " " + СтрСоединить(СписокПодразделений.ВыгрузитьЗначения(), ", ");
			КонецЕсли; 
		КонецЕсли;
		Если ОбластьШапка.Параметры.Отбор <> "" Тогда
			ОбластьШапка.Параметры.Отбор = ОбластьШапка.Параметры.Отбор + "; ";
		КонецЕсли;
		ОбластьШапка.Параметры.Отбор = ОбластьШапка.Параметры.Отбор + СписокОтбор;
		
	КонецЕсли; 
		
	РезультатЗапроса = СформироватьЗапрос(ПараметрыОтчета);
	
	Если РезультатЗапроса.Пустой() Тогда
	
		ТекстСообщения = НСтр("ru='Данные не обнаружены!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	    Возврат;
		
	КонецЕсли;
	
	ВыборкаПоПериоду = РезультатЗапроса.Выбрать();
	Линия	=	Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	СтруктураПустогоПодвала = Новый Структура(
		"ДолгЗаПредприятиемНаНачалоМесяца, ДолгЗаРаботникамиНаНачалоМесяца,
		|ДолгЗаПредприятиемНаКонецМесяца, ДолгЗаРаботникамиНаКонецМесяца,
		|ВсегоНачисления,ВсегоУдержания");

	// обнулим все
	МассивКлючей = Новый Массив();
	Для Каждого КлючИЗначение Из СтруктураПустогоПодвала Цикл
		МассивКлючей.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	Для Каждого Ключ Из МассивКлючей Цикл
		СтруктураПустогоПодвала.Вставить(Ключ, 0);
	КонецЦикла;
		
	Если ПараметрыОтчета.СводныеДанныеПоОрганизациям Тогда
		ЕстьДанные = Истина;
	Иначе
		ЕстьДанные = ВыборкаПоПериоду.СледующийПоЗначениюПоля("Организация") ;
	КонецЕсли;
	
	Пока ЕстьДанные Цикл
		
		Если ПараметрыОтчета.СводныеДанныеПоОрганизациям Тогда
			ОбластьШапка.Параметры.Организация = "";
		Иначе
			ОбластьШапка.Параметры.Организация = НСтр("ru='по '") + ВыборкаПоПериоду.ИмяОрганизация;
		КонецЕсли;
		ТекстПериода = Формат(ПараметрыОтчета.НачалоПериода, "ДФ = 'ММММ гггг'");
		Если НачалоМесяца(ПараметрыОтчета.НачалоПериода) <> НачалоМесяца(ПараметрыОтчета.КонецПериода) Тогда
			ТекстПериода = ТекстПериода + " - " + Формат(ПараметрыОтчета.КонецПериода, "ДФ = 'ММММ гггг'");
		КонецЕсли;
		ОбластьШапка.Параметры.Период = НСтр("ru='Период: '") + ТекстПериода;
		ОбластьИтоги.Область(1, 2).Текст = НСтр("ru='Всего начислено:'");
		ОбластьИтоги.Область(1, 6).Текст = НСтр("ru='Всего удержано:'");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Очистим суммы в подвале свода
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,СтруктураПустогоПодвала);
		ЗаполнитьЗначенияСвойств(ОбластьИтоги.Параметры,СтруктураПустогоПодвала);
		
		// Очистим суммы ОППВ
		ОбластьОППВ.Параметры.ОППВ = 0;
		
		// Очистим суммы ООСМС
		ОбластьООСМС_ОПВР.Параметры.ООСМС = 0;
		ОбластьООСМС_ОПВР.Параметры.ОПВР = 0;		
		ОбластьСНСО.Параметры.СоциальныйНалог = 0;
		ОбластьСНСО.Параметры.СоциальныеОтчисления = 0;

		// ЕП
		ОбластьЕП.Параметры.ЕПЗаМесяц = 0;
		ОбластьЕП.Параметры.ЕПЗаСчетРаботодателя = 0;
		
		ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы + 1;
		ВсегоНачисления			= 0;
		ВсегоОтработаноДней		= 0;
		ВсегоОтработаноЧасов	= 0;
		ВсегоУдержания 			= 0;
		КоличествоНачислений 	= 0;
		КоличествоУдержаний  	= 0;
		ИтогиНачисленийИУдержанийВыведены = Ложь;	
		
		Пока ВыборкаПоПериоду.Следующий() Цикл
			
			Если ВыборкаПоПериоду.ВидДвижения < 2 Тогда
					
				НомерСтроки = ВысотаТаблицы + КоличествоНачислений;
				ТабличныйДокумент.Область(НомерСтроки, 2).Текст = ВыборкаПоПериоду.ВидРасчетаНаименование;
				ТабличныйДокумент.Область(НомерСтроки, 3).Текст = ВыборкаПоПериоду.УчитываемыеДни;
				ТабличныйДокумент.Область(НомерСтроки, 4).Текст = ВыборкаПоПериоду.УчитываемыеЧасы;
				ТабличныйДокумент.Область(НомерСтроки, 5).Текст = ВыборкаПоПериоду.Начисления;
				ТабличныйДокумент.Область(НомерСтроки, 5).СодержитЗначение = Истина; 	
				ТабличныйДокумент.Область(НомерСтроки, 5).Значение = Формат(ВыборкаПоПериоду.Начисления, "ЧЦ=15; ЧДЦ=2");
				
				ВсегоНачисления	= ВсегоНачисления + ВыборкаПоПериоду.Начисления;
				ВсегоОтработаноДней = ВсегоОтработаноДней + ВыборкаПоПериоду.ОтработаноДней;
				ВсегоОтработаноЧасов = ВсегоОтработаноЧасов + ВыборкаПоПериоду.ОтработаноЧасов;
					
				КоличествоНачислений = КоличествоНачислений + 1;

			ИначеЕсли ВыборкаПоПериоду.ВидДвижения < 6 Тогда

				НомерСтроки = ВысотаТаблицы + КоличествоУдержаний;
				ТабличныйДокумент.Область(НомерСтроки, 6).Текст = ВыборкаПоПериоду.ВидРасчета;
				ТабличныйДокумент.Область(НомерСтроки, 6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
				ТабличныйДокумент.Область(НомерСтроки, 7).Текст = ВыборкаПоПериоду.Удержания;
				ТабличныйДокумент.Область(НомерСтроки, 7).СодержитЗначение = Истина; 	
				ТабличныйДокумент.Область(НомерСтроки, 7).Значение = Формат(ВыборкаПоПериоду.Удержания, "ЧЦ=15; ЧДЦ=2");
				
				ВсегоУдержания = ВсегоУдержания + ВыборкаПоПериоду.Удержания;
				
				КоличествоУдержаний = КоличествоУдержаний + 1;
			
			Иначе		
				// подведем итоги раздела начислений и удержаний
				// начнем раздел доходов в натуральной форме и выплат
					
				Если Не ИтогиНачисленийИУдержанийВыведены Тогда
						
					ОбластьИтоги.Параметры.ВсегоНачисления      = ВсегоНачисления;
					ОбластьИтоги.Параметры.ВсегоОтработаноДней  = ВсегоОтработаноДней;
					ОбластьИтоги.Параметры.ВсегоОтработаноЧасов = ВсегоОтработаноЧасов;
					ОбластьИтоги.Параметры.ВсегоУдержания       = ВсегоУдержания;
					ИтогиНачисленийИУдержанийВыведены           = Не ИтогиНачисленийИУдержанийВыведены;
						
					КолвоРасчетов = Макс(КоличествоНачислений,КоличествоУдержаний);
						
					Если КолвоРасчетов > 0 Тогда
							
						Для Сч = 0 По КолвоРасчетов - 1 Цикл
								
							НомерСтроки = ВысотаТаблицы + Сч;
								
							Для Ссч = 2 По 7 Цикл
									
								ТабличныйДокумент.Область(НомерСтроки, Ссч).ГраницаСлева = Линия;
									
							КонецЦикла;
								
							ТабличныйДокумент.Область(НомерСтроки, 7).ГраницаСправа = Линия;
							ТабличныйДокумент.Область(НомерСтроки, 2, НомерСтроки, 7).ГраницаСнизу = Линия;
								
						КонецЦикла; 
							
						ТабличныйДокумент.Вывести(ОбластьИтоги);
					КонецЕсли; 
						
					ОбластьИтоги.Область(1, 2).Текст = НСтр("ru='Всего доходов в натуральной форме:'");
					ОбластьИтоги.Область(1, 6).Текст = НСтр("ru='Всего выплачено:'");
						
					ЗаполнитьЗначенияСвойств(ОбластьИтоги.Параметры, СтруктураПустогоПодвала);
						
					ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы + 1;
					ВсегоНачисления = 0;   КоличествоНачислений = 0;
					ВсегоУдержания  = 0;   КоличествоУдержаний  = 0;
					ВсегоОтработаноДней  = 0;
					ВсегоОтработаноЧасов = 0;
						
				КонецЕсли;
				
				Если ВыборкаПоПериоду.ВидДвижения < 7 Тогда 
						
					НомерСтроки = ВысотаТаблицы + КоличествоНачислений;
					ТабличныйДокумент.Область(НомерСтроки, 2).Текст = ВыборкаПоПериоду.ВидРасчета;
					ТабличныйДокумент.Область(НомерСтроки, 3).Текст = ВыборкаПоПериоду.УчитываемыеДни;
					ТабличныйДокумент.Область(НомерСтроки, 4).Текст = ВыборкаПоПериоду.УчитываемыеЧасы;
					ТабличныйДокумент.Область(НомерСтроки, 5).Текст = ВыборкаПоПериоду.Начисления;
					ТабличныйДокумент.Область(НомерСтроки, 5).СодержитЗначение = Истина; 	
					ТабличныйДокумент.Область(НомерСтроки, 5).Значение = Формат(ВыборкаПоПериоду.Начисления, "ЧЦ=15; ЧДЦ=2");
						
					ВсегоНачисления      = ВсегоНачисления      + ВыборкаПоПериоду.Начисления;
					ВсегоОтработаноДней  = ВсегоОтработаноДней  + ВыборкаПоПериоду.ОтработаноДней;
					ВсегоОтработаноЧасов = ВсегоОтработаноЧасов + ВыборкаПоПериоду.ОтработаноЧасов;
						
					КоличествоНачислений = КоличествоНачислений + 1;
						
				Иначе
						
					Если ЗначениеЗаполнено(ВыборкаПоПериоду.Удержания) Тогда
							
						НомерСтроки = ВысотаТаблицы + КоличествоУдержаний;
						ТабличныйДокумент.Область(НомерСтроки, 6).Текст = ВыборкаПоПериоду.ВидРасчета;
						ТабличныйДокумент.Область(НомерСтроки, 6).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
						ТабличныйДокумент.Область(НомерСтроки, 7).Текст = ВыборкаПоПериоду.Удержания;
						ТабличныйДокумент.Область(НомерСтроки, 7).СодержитЗначение = Истина; 	
						ТабличныйДокумент.Область(НомерСтроки, 7).Значение = Формат(ВыборкаПоПериоду.Удержания, "ЧЦ=15; ЧДЦ=2");
							
						ВсегоУдержания = ВсегоУдержания + ВыборкаПоПериоду.Удержания;
							
						КоличествоУдержаний = КоличествоУдержаний + 1;
					КонецЕсли;
						
					// Данные для подвала
					ОбластьПодвал.Параметры.ДолгЗаПредприятиемНаНачалоМесяца = ОбластьПодвал.Параметры.ДолгЗаПредприятиемНаНачалоМесяца + ВыборкаПоПериоду.ДолгЗаПредприятиемНаНачалоМесяца;
					ОбластьПодвал.Параметры.ДолгЗаРаботникамиНаНачалоМесяца  = ОбластьПодвал.Параметры.ДолгЗаРаботникамиНаНачалоМесяца  + ВыборкаПоПериоду.ДолгЗаРаботникамиНаНачалоМесяца;					
					
					ОбластьПодвал.Параметры.ДолгЗаПредприятиемНаКонецМесяца  = ОбластьПодвал.Параметры.ДолгЗаПредприятиемНаКонецМесяца  + ВыборкаПоПериоду.ДолгЗаПредприятиемНаКонецМесяца;
					ОбластьПодвал.Параметры.ДолгЗаРаботникамиНаКонецМесяца   = ОбластьПодвал.Параметры.ДолгЗаРаботникамиНаКонецМесяца   + ВыборкаПоПериоду.ДолгЗаРаботникамиНаКонецМесяца;
					
					ОбластьСНСО.Параметры.СоциальныйНалог      = ОбластьСНСО.Параметры.СоциальныйНалог      + ВыборкаПоПериоду.СоциальныйНалог;
					ОбластьСНСО.Параметры.СоциальныеОтчисления = ОбластьСНСО.Параметры.СоциальныеОтчисления + ВыборкаПоПериоду.СоциальныеОтчисления;
					
					// Данные ОППВ
					ОбластьОППВ.Параметры.ОППВ = ОбластьОППВ.Параметры.ОППВ + ВыборкаПоПериоду.ОППВ;
					
					// Данные ООСМС
					ОбластьООСМС_ОПВР.Параметры.ОПВР = ОбластьООСМС_ОПВР.Параметры.ОПВР + ВыборкаПоПериоду.ОПВР;
					ОбластьООСМС_ОПВР.Параметры.ООСМС = ОбластьООСМС_ОПВР.Параметры.ООСМС + ВыборкаПоПериоду.ООСМС;
					ОбластьЕП.Параметры.ЕПЗаМесяц = ОбластьЕП.Параметры.ЕПЗаМесяц + ВыборкаПоПериоду.ЕП;
					ОбластьЕП.Параметры.ЕПЗаСчетРаботодателя = ОбластьЕП.Параметры.ЕПЗаСчетРаботодателя + ВыборкаПоПериоду.ЕПЗаСчетРаботодателя;
				КонецЕсли;
					
			КонецЕсли;
				
		КонецЦикла; 
				
		ОбластьИтоги.Параметры.ВсегоНачисления      = ВсегоНачисления;
		ОбластьИтоги.Параметры.ВсегоОтработаноДней  = ВсегоОтработаноДней;
		ОбластьИтоги.Параметры.ВсегоОтработаноЧасов = ВсегоОтработаноЧасов;
		ОбластьИтоги.Параметры.ВсегоУдержания       = ВсегоУдержания;
		
		КолвоРасчетов = Макс(КоличествоНачислений, КоличествоУдержаний);
			
		Если КолвоРасчетов > 0 Тогда
				
			Для Сч = 0 По КолвоРасчетов - 1 Цикл
					
				НомерСтроки = ВысотаТаблицы + Сч;
					
				Для Ссч = 2 По 7 Цикл
						
					ТабличныйДокумент.Область(НомерСтроки, Ссч).ГраницаСлева = Линия;
						
				КонецЦикла;
					
				ТабличныйДокумент.Область(НомерСтроки, 7).ГраницаСправа = Линия;
				ТабличныйДокумент.Область(НомерСтроки, 2, НомерСтроки, 7).ГраницаСнизу = Линия;
					
			КонецЦикла; 
				
			ТабличныйДокумент.Вывести(ОбластьИтоги);
			
		КонецЕсли; 
						
		Если ОбластьЕП.Параметры.ЕПЗаМесяц <> 0 Тогда
			ТабличныйДокумент.Вывести(ОбластьЕП);
		КонецЕсли;
			
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		Если НЕ (ОбластьСНСО.Параметры.СоциальныйНалог = 0
			И ОбластьСНСО.Параметры.СоциальныеОтчисления = 0) Тогда
			ТабличныйДокумент.Вывести(ОбластьСНСО);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьООСМС_ОПВР);

		Если ОбластьОППВ.Параметры.ОППВ <> 0 Тогда
			ТабличныйДокумент.Вывести(ОбластьОППВ);
		КонецЕсли;
						
		Если ПараметрыОтчета.СводныеДанныеПоОрганизациям Тогда
			ЕстьДанные = Ложь;
		Иначе
			ЕстьДанные = ВыборкаПоПериоду.СледующийПоЗначениюПоля("Организация");
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
